RfidResearchGroup/proxmark3/armlib/AT32F435xx_v2.svd
        <register>
          <name>EXT3</name>
          <displayName>EXT3</displayName>
          <description>externl timeing register 3</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <fields>
            <field>
              <name>BUSLATW2W</name>
              <description>Bus turnaround phase for consecutive write duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSLATR2R</name>
              <description>Bus turnaround phase for consecutive read duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT4</name>
          <displayName>EXT4</displayName>
          <description>externl timeing register 4</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000808</resetValue>
          <fields>
            <field>
              <name>BUSLATW2W</name>
              <description>Bus turnaround phase for consecutive write duration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BUSLATR2R</name>
              <description>Bus turnaround phase for consecutive read duration</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWC</name>
      <description>Power control</description>
      <groupName>PWC</groupName>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <displayName>CTRL</displayName>
          <description>Power control register
          (PWC_CTRL)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VRSEL</name>
              <description>Voltage regulator state select when deepsleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPSEL</name>
              <description>Low power mode select when Cortex-M4F sleepdeep</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLSWEF</name>
              <description>Clear SWEF flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLSEF</name>
              <description>Clear SEF flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVMEN</name>
              <description>Power voltage monitoring enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVMSEL</name>
              <description>Power voltage monitoring boundary select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>BPWEN</name>
              <description>Battery powered domain write enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLSTS</name>
          <displayName>CTRLSTS</displayName>
          <description>Power control and status register
          (PWC_CTRLSTS)</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SWEF</name>
              <description>Standby wake-up event flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEF</name>
              <description>Standby mode entry flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVMOF</name>
              <description>Power voltage monitoring output flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SWPEN1</name>
              <description>Standby wake-up pin 1 enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWPEN2</name>
              <description>Standby wake-up pin 2 enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDOOV</name>
          <displayName>LDOOV</displayName>
          <description>LDO output voltage register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LDOOVSEL</name>
              <description>LDO output voltage select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
