RfidResearchGroup/proxmark3/armlib/AT32F435xx_v2.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC2</name>
      <baseAddress>0x40012100</baseAddress>
      <interrupt>
        <name>ADC</name>
        <description>ADC2 global interrupts</description>
        <value>18</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC3</name>
      <baseAddress>0x40012200</baseAddress>
      <interrupt>
        <name>ADC</name>
        <description>ADC3 global interrupts</description>
        <value>18</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ADCCOM</name>
      <description>ADC common area</description>
      <groupName>ADC</groupName>
      <baseAddress>0x40012300</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSTS</name>
          <displayName>CSTS</displayName>
          <description>Common status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RDY3</name>
              <description>ADC ready to conversion flag of ADC3</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCCO3</name>
              <description>Ordinary channel conversion overflow flag of ADC3</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCCS3</name>
              <description>Ordinary channel conversion start flag of ADC3</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCCS3</name>
              <description>Preempted channel conversion start flag of ADC3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCCE3</name>
              <description>Preempted channels conversion end flag of ADC3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCCE3</name>
              <description>Ordinary channels conversion end flag of ADC3</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VMOR3</name>
              <description>Voltage monitoring out of range flag of ADC3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDY2</name>
              <description>ADC ready to conversion flag of ADC2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCCO2</name>
              <description>Ordinary channel conversion overflow flag of ADC2</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCCS2</name>
              <description>Ordinary channel conversion start flag of ADC2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCCS2</name>
              <description>Preempted channel conversion start flag of ADC2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCCE2</name>
              <description>Preempted channels conversion end flag of ADC2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCCE2</name>
              <description>Ordinary channels conversion end flag of ADC2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VMOR2</name>
              <description>Voltage monitoring out of range flag of ADC2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RDY1</name>
              <description>ADC ready to conversion flag of ADC1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCCO1</name>
              <description>Ordinary channel conversion overflow flag of ADC1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCCS1</name>
              <description>Ordinary channel conversion start flag of ADC1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCCS1</name>
              <description>Preempted channel conversion start flag of ADC1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCCE1</name>
              <description>Preempted channels conversion end flag of ADC1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCCE1</name>
              <description>Ordinary channels conversion end flag of ADC1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VMOR1</name>
              <description>Voltage monitoring out of range flag of ADC1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CCTRL</name>
          <displayName>CCTRL</displayName>
          <description>Common control register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MSDMASEL_H</name>
              <description>High bit of ordinary channel DMA transfer mode select for master slave mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ITSRVEN</name>
              <description>Internal temperature sensor and VINTRV enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBATEN</name>
              <description>VBAT enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCDIV</name>
              <description>ADC division</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MSDMASEL_L</name>
              <description>Low bit of ordinary channel DMA transfer mode select for master slave mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MSDRCEN</name>
              <description>Ordinary channel DMA request continuation enable for master slave mode</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ASISEL</name>
              <description>Adjacent ADC sampling interval select for ordinary shifting mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MSSEL</name>
              <description>Master slave mode select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CODT</name>
          <displayName>CODT</displayName>
          <description>Common Ordinary data register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CODTH</name>
              <description>Ordinary conversion high halfword data for master slave mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>CODTL</name>
              <description>Ordinary conversion low halfword data for master slave mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
